MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KL401/mcu.h
extern volatile T1CONBITS T1CONbits __attribute__((__sfr__));

#define TMR2 TMR2
extern volatile uint8_t TMR2 __attribute__((__sfr__));
#define PR2 PR2
extern volatile uint16_t PR2 __attribute__((__sfr__));
#define T2CON T2CON
extern volatile uint16_t T2CON __attribute__((__sfr__));
__extension__ typedef struct tagT2CONBITS {
  union {
    struct {
      uint16_t T2CKPS:2;
      uint16_t TMR2ON:1;
      uint16_t T2OUTPS:4;
    };
    struct {
      uint16_t TCKPS:2;
      uint16_t TON:1;
      uint16_t TOUTPS:4;
    };
    struct {
      uint16_t T2CKPS0:1;
      uint16_t T2CKPS1:1;
      uint16_t :1;
      uint16_t T2OUTPS0:1;
      uint16_t T2OUTPS1:1;
      uint16_t T2OUTPS2:1;
      uint16_t T2OUTPS3:1;
    };
  };
} T2CONBITS;
extern volatile T2CONBITS T2CONbits __attribute__((__sfr__));

#define TMR3 TMR3
extern volatile uint16_t TMR3 __attribute__((__sfr__));
#define T3GCON T3GCON
extern volatile uint16_t T3GCON __attribute__((__sfr__));
__extension__ typedef struct tagT3GCONBITS {
  union {
    struct {
      uint16_t T3GSS:2;
      uint16_t T3GVAL:1;
      uint16_t T3GGO:1;
      uint16_t T3GSPM:1;
      uint16_t T3GTM:1;
      uint16_t T3GPOL:1;
      uint16_t TMR3GE:1;
    };
    struct {
      uint16_t T3GSS0:1;
      uint16_t T3GSS1:1;
      uint16_t :1;
      uint16_t NOT_T3DONE:1;
    };
    struct {
      uint16_t TGSS:2;
      uint16_t TGVAL:1;
      uint16_t TGGO:1;
      uint16_t TGSE:1;
      uint16_t TGTM:1;
      uint16_t TGPOL:1;
      uint16_t TGATE:1;
    };
  };
} T3GCONBITS;
extern volatile T3GCONBITS T3GCONbits __attribute__((__sfr__));

#define T3CON T3CON
extern volatile uint16_t T3CON __attribute__((__sfr__));
__extension__ typedef struct tagT3CONBITS {
  union {
    struct {
      uint16_t TMR3ON:1;
      uint16_t :1;
      uint16_t NOT_T3SYNC:1;
      uint16_t T3OSCEN:1;
      uint16_t T3CKPS:2;
      uint16_t TMR3CS:2;
    };
    struct {
      uint16_t TON:1;
      uint16_t :1;
      uint16_t NOT_TSYNC:1;
      uint16_t SOSCEN:1;
      uint16_t TCKPS:2;
      uint16_t TCS:2;
    };
    struct {
      uint16_t :4;
      uint16_t T3CKPS0:1;
      uint16_t T3CKPS1:1;
      uint16_t TMR3CS0:1;
      uint16_t TMR3CS1:1;
    };
  };
} T3CONBITS;
extern volatile T3CONBITS T3CONbits __attribute__((__sfr__));

#define TMR4 TMR4
extern volatile uint16_t TMR4 __attribute__((__sfr__));
#define PR4 PR4
extern volatile uint16_t PR4 __attribute__((__sfr__));
#define T4CON T4CON
extern volatile uint16_t T4CON __attribute__((__sfr__));
__extension__ typedef struct tagT4CONBITS {
  union {
    struct {
      uint16_t T4CKPS:2;
      uint16_t TMR4ON:1;
      uint16_t T4OUTPS:4;
    };
    struct {
      uint16_t TCKPS:2;
      uint16_t TON:1;
      uint16_t TOUTPS:4;
    };
    struct {
      uint16_t T4CKPS0:1;
      uint16_t T4CKPS1:1;
      uint16_t :1;
      uint16_t T4OUTPS0:1;
      uint16_t T4OUTPS1:1;
      uint16_t T4OUTPS2:1;
      uint16_t T4OUTPS3:1;
    };
  };
} T4CONBITS;
extern volatile T4CONBITS T4CONbits __attribute__((__sfr__));

#define CCPTMRS0 CCPTMRS0
extern volatile uint16_t CCPTMRS0 __attribute__((__sfr__));
typedef struct tagCCPTMRS0BITS {
  uint16_t C1TSEL0:1;
  uint16_t :2;
  uint16_t C2TSEL0:1;
  uint16_t :2;
  uint16_t C3TSEL0:1;
} CCPTMRS0BITS;
extern volatile CCPTMRS0BITS CCPTMRS0bits __attribute__((__sfr__));

#define CCP1CON CCP1CON
extern volatile uint16_t CCP1CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CONBITS {
  union {
    struct {
      uint16_t CCPM:4;
      uint16_t DCB:2;
      uint16_t PM:2;
    };
    struct {
      uint16_t CCPM0:1;
      uint16_t CCPM1:1;
      uint16_t CCPM2:1;
      uint16_t CCPM3:1;
      uint16_t DCB0:1;
      uint16_t DCB1:1;
      uint16_t PM0:1;
      uint16_t PM1:1;
    };
    struct {
      uint16_t CCP1M:4;
      uint16_t DC1B:2;
      uint16_t P1M:2;
    };
    struct {
      uint16_t CCP1M0:1;
      uint16_t CCP1M1:1;
      uint16_t CCP1M2:1;
      uint16_t CCP1M3:1;
      uint16_t DC1B0:1;
      uint16_t DC1B1:1;
      uint16_t P1M0:1;
      uint16_t P1M1:1;
    };
  };
} CCP1CONBITS;
extern volatile CCP1CONBITS CCP1CONbits __attribute__((__sfr__));

#define ECCP1CON ECCP1CON
extern volatile uint16_t ECCP1CON __attribute__((__sfr__));
__extension__ typedef struct tagECCP1CONBITS {
  union {
    struct {
      uint16_t CCPM:4;
      uint16_t DCB:2;
      uint16_t PM:2;
    };
    struct {
      uint16_t CCPM0:1;
      uint16_t CCPM1:1;
      uint16_t CCPM2:1;
      uint16_t CCPM3:1;
      uint16_t DCB0:1;
      uint16_t DCB1:1;
      uint16_t PM0:1;
      uint16_t PM1:1;
    };
    struct {
      uint16_t CCP1M:4;
      uint16_t DC1B:2;
      uint16_t P1M:2;
    };
    struct {
      uint16_t CCP1M0:1;
      uint16_t CCP1M1:1;
      uint16_t CCP1M2:1;
      uint16_t CCP1M3:1;
      uint16_t DC1B0:1;
      uint16_t DC1B1:1;
      uint16_t P1M0:1;
      uint16_t P1M1:1;
    };
  };
} ECCP1CONBITS;
extern volatile ECCP1CONBITS ECCP1CONbits __attribute__((__sfr__));

#define CCPR1L CCPR1L
extern volatile uint8_t CCPR1L __attribute__((__sfr__));
#define CCPR1H CCPR1H
extern volatile uint8_t CCPR1H __attribute__((__sfr__));
#define ECCP1DEL ECCP1DEL
extern volatile uint16_t ECCP1DEL __attribute__((__sfr__));
__extension__ typedef struct tagECCP1DELBITS {
  union {
    struct {
      uint16_t PDC:7;
      uint16_t PRSEN:1;
    };
    struct {
      uint16_t PDC0:1;
      uint16_t PDC1:1;
      uint16_t PDC2:1;
      uint16_t PDC3:1;
      uint16_t PDC4:1;
      uint16_t PDC5:1;
      uint16_t PDC6:1;
    };
    struct {
      uint16_t P1DC:7;
      uint16_t P1RSEN:1;
    };
    struct {
      uint16_t P1DC0:1;
      uint16_t P1DC1:1;
      uint16_t P1DC2:1;
      uint16_t P1DC3:1;
      uint16_t P1DC4:1;
      uint16_t P1DC5:1;
      uint16_t P1DC6:1;
    };
  };
} ECCP1DELBITS;
extern volatile ECCP1DELBITS ECCP1DELbits __attribute__((__sfr__));

#define PWM1CON PWM1CON
extern volatile uint16_t PWM1CON __attribute__((__sfr__));
__extension__ typedef struct tagPWM1CONBITS {
  union {
    struct {
      uint16_t PDC:7;
      uint16_t PRSEN:1;
    };
    struct {
      uint16_t PDC0:1;
      uint16_t PDC1:1;
      uint16_t PDC2:1;
      uint16_t PDC3:1;
      uint16_t PDC4:1;
      uint16_t PDC5:1;
      uint16_t PDC6:1;
    };
    struct {
      uint16_t P1DC:7;
      uint16_t P1RSEN:1;
    };
    struct {
      uint16_t P1DC0:1;
      uint16_t P1DC1:1;
      uint16_t P1DC2:1;
      uint16_t P1DC3:1;
      uint16_t P1DC4:1;
      uint16_t P1DC5:1;
      uint16_t P1DC6:1;
    };
  };
} PWM1CONBITS;
extern volatile PWM1CONBITS PWM1CONbits __attribute__((__sfr__));

#define ECCP1AS ECCP1AS
extern volatile uint16_t ECCP1AS __attribute__((__sfr__));
__extension__ typedef struct tagECCP1ASBITS {
  union {
    struct {
      uint16_t PSSBD:2;
      uint16_t PSSAC:2;
      uint16_t ECCPAS:3;
      uint16_t ECCPASE:1;
    };
    struct {
      uint16_t PSSBD0:1;
      uint16_t PSSBD1:1;
      uint16_t PSSAC0:1;
      uint16_t PSSAC1:1;
      uint16_t ECCPAS0:1;
      uint16_t ECCPAS1:1;
      uint16_t ECCPAS2:1;
    };
    struct {
      uint16_t PSS1BD:2;
      uint16_t PSS1AC:2;
      uint16_t ECCP1AS:3;
    };
    struct {
      uint16_t PSS1BD0:1;
      uint16_t PSS1BD1:1;
      uint16_t PSS1AC0:1;
      uint16_t PSS1AC1:1;
      uint16_t ECCP1AS0:1;
      uint16_t ECCP1AS1:1;
      uint16_t ECCP1AS2:1;
    };
  };
} ECCP1ASBITS;
